// Напишите программу, которая принимает на вход 
// координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 
// и выдаёт номер координатной четверти плоскости,
// в которой находится эта точка.

Console.Write("Введите первую координату: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите вторую координату: ");
int secondNumber = Convert.ToInt32(Console.ReadLine());

